; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared2 - mode
	infrared3 - mode
	spectrograph0 - mode
	thermograph4 - mode
	thermograph1 - mode
	thermograph5 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star6 - direction
	Star1 - direction
	Star2 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph5)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Planet9 infrared2)
	(have_image Planet9 thermograph4)
	(have_image Planet10 thermograph4)
	(have_image Planet10 thermograph1)
	(have_image Star11 thermograph1)
	(have_image Star11 thermograph5)
	(have_image Star12 infrared2)
	(have_image Phenomenon13 thermograph5)
	(have_image Phenomenon13 thermograph4)
	(have_image Star14 infrared3)
	(have_image Star14 infrared2)
	(have_image Planet15 infrared2)
))

)

; plan
1. (turn_to satellite0 star1 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star1)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 planet9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet9)
   goals met: 0 of 12
5. (take_image satellite0 planet9 instrument0 thermograph4)
   added: (have_image planet9 thermograph4)
   goals met: 1 of 12
6. (take_image satellite0 planet9 instrument0 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 2 of 12
7. (turn_to satellite0 planet15 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet15)
   goals met: 2 of 12
8. (take_image satellite0 planet15 instrument0 infrared2)
   added: (have_image planet15 infrared2)
   goals met: 3 of 12
9. (turn_to satellite0 planet10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet10)
   goals met: 3 of 12
10. (take_image satellite0 planet10 instrument0 thermograph4)
   added: (have_image planet10 thermograph4)
   goals met: 4 of 12
11. (take_image satellite0 planet10 instrument0 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 5 of 12
12. (turn_to satellite0 phenomenon13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 12
13. (take_image satellite0 phenomenon13 instrument0 thermograph5)
   added: (have_image phenomenon13 thermograph5)
   goals met: 6 of 12
14. (take_image satellite0 phenomenon13 instrument0 thermograph4)
   added: (have_image phenomenon13 thermograph4)
   goals met: 7 of 12
15. (turn_to satellite0 star11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star11)
   goals met: 7 of 12
16. (take_image satellite0 star11 instrument0 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 8 of 12
17. (take_image satellite0 star11 instrument0 thermograph5)
   added: (have_image star11 thermograph5)
   goals met: 9 of 12
18. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 9 of 12
19. (take_image satellite0 star12 instrument0 infrared2)
   added: (have_image star12 infrared2)
   goals met: 10 of 12
20. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 10 of 12
21. (take_image satellite0 star14 instrument0 infrared2)
   added: (have_image star14 infrared2)
   goals met: 11 of 12
22. (take_image satellite0 star14 instrument0 infrared3)
   added: (have_image star14 infrared3)
   goals met: 12 of 12
